Tekla Open API Reference for Tekla Structures 2025
LineTypeAttributes Class
 The LineTypeAttributes class contains basic attributes for lines.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.LineTypeAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class LineTypeAttributes : GenericAttributesBase
<SerializableAttribute>
Public NotInheritable Class LineTypeAttributes
	Inherits GenericAttributesBase
The LineTypeAttributes type exposes the following members.
Constructors
Name | Description
LineTypeAttributes()
 Creates a new line type attributes instance.
LineTypeAttributes(LineTypes, DrawingColors)
 Creates a new line type attributes instance with the given line type and color.
LineTypeAttributes(LineTypes, TeklaDrawingColor)
 Creates a new line type attributes instance with the given line type and color.
Top
Properties
Name | Description
Color
 The color of the line (see DrawingColors for options).
TrueColor
 The true color (rgb enabled) of the line.
Type
 The type of the line (see LineTypes for options).
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace